{
  "id": "3.1.1",
  "family_id": "AC",
  "family_name": "Access Control",
  "title": "Limit system access to authorized users, processes acting on behalf of authorized users, and devices (including other systems).",
  "description": "Limit system access to authorized users, processes acting on behalf of authorized users, and devices (including other systems).",
  "discussion": "Access control policies (e.g., identity or role-based policies, control matrices, and cryptography) control access between active entities or subjects (i.e., users or processes acting on behalf of users) and passive entities or objects (e.g., devices, files, records, and domains) in systems. Access enforcement mechanisms can be employed at the application and service level to provide increased information security. Other systems include systems internal and external to the organization. This requirement focuses on account management for systems and applications. The definition of and enforcement of access authorizations, other than those determined by account type (e.g., privileged verses non-privileged) are addressed in requirement 3.1.2.",
  "implementation_guidance": "Organizations may choose to define access privileges or other attributes by account, by type of account, or a combination of both. System account types include individual, shared, group, system, anonymous, guest, emergency, developer, manufacturer, vendor, and temporary. Other attributes required for authorizing access include restrictions on time-of-day, day-of-week, and point-of-origin. In defining other account attributes, organizations consider system-related requirements (e.g., system upgrades scheduled maintenance) and mission or business requirements, (e.g., time zone differences, customer requirements, remote access to support travel requirements).",
  "assessment_procedures": "ASSESSMENT OBJECTIVE: Determine if the organization limits system access to authorized users, processes acting on behalf of authorized users, and devices (including other systems). ASSESSMENT METHODS AND OBJECTS: Examine: [SELECT FROM: Access control policy; procedures addressing account management; system security plan; system design documentation; system configuration settings and associated documentation; list of active system accounts and the name of the individual associated with each account; notifications or records of recently transferred, separated, or terminated employees; list of conditions for group and role membership; list of recently disabled system accounts along with the name of the individual associated with each account; access authorization records; account management compliance reviews; system monitoring records; system audit logs and records; list of devices accessing the system; list of conditions for group and role membership; organization-defined parameters for shared/group account credential termination; other relevant documents or records].",
  "asset_types": ["Systems", "Users", "Processes", "Devices"],
  "priority": "P1"
}